app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "genre", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @book = Book.new(subject_params)
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "author" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["author", "Bob Woodwards"], ["updated_at", "2020-10-11 05:39:37.631702"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update_attributes(subject_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def delete
    @book = Book.find(params[:id])